# Задайте последовательность чисел. Напишите программу, которая выведет список элементов, 
# которые не имели повторов в исходной последовательности.
# Ввод:
# 3 1 2 3
# Вывод:
# 2 1

lst = list(map(int, input("Введите числа через пробел:\n").split()))
print(f"Исходный список: {lst}")

dub = {x for x in lst if lst.count(x) > 1}

my_set = set(lst)

dif_1 = my_set.difference(dub)
print(dif_1)




