# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 6 | N = 12    | 32                | 13 | 9     | 18        | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

num = int(input("Введите число: "))
i = 2 
prime_factors = []
num_1 = num
while i <= num:
    if num % i == 0:
        prime_factors.append(i)
        num //= i
        i = 2
    else:
        i += 1

print(f"Простые множители числа {num_1} приведены в списке: {prime_factors}")
